{
    "nb_actions": 6,
    "gamma": 0.3,
    "batch_size": 16,
    "nb_steps_warmup": 50,
    "train_interval": 1,
    "memory_interval": 1,
    "target_model_update": 0.1,
    "delta_clip": Infinity,
    "memory": {
        "class_name": "SequentialMemory",
        "config": {
            "window_length": 1,
            "ignore_episode_boundaries": false,
            "limit": 50000
        }
    },
    "enable_double_dqn": false,
    "dueling_type": "avg",
    "enable_dueling_network": false,
    "model": {
        "class_name": "Functional",
        "config": {
            "name": "model",
            "layers": [
                {
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            1,
                            5,
                            5
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "input_1"
                    },
                    "name": "input_1",
                    "inbound_nodes": []
                },
                {
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    },
                    "name": "flatten",
                    "inbound_nodes": [
                        [
                            [
                                "input_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 16,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "dense",
                    "inbound_nodes": [
                        [
                            [
                                "flatten",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 16,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "dense_1",
                    "inbound_nodes": [
                        [
                            [
                                "dense",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_2",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 16,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "dense_2",
                    "inbound_nodes": [
                        [
                            [
                                "dense_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_3",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 16,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "dense_3",
                    "inbound_nodes": [
                        [
                            [
                                "dense_2",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_4",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 6,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "dense_4",
                    "inbound_nodes": [
                        [
                            [
                                "dense_3",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "input_1",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "dense_4",
                    0,
                    0
                ]
            ]
        }
    },
    "policy": {
        "class_name": "BoltzmannQPolicy",
        "config": {
            "tau": 1.0,
            "clip": [
                -500.0,
                500.0
            ]
        }
    },
    "test_policy": {
        "class_name": "GreedyQPolicy",
        "config": {}
    },
    "target_model": {
        "class_name": "Functional",
        "config": {
            "name": "model",
            "layers": [
                {
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            1,
                            5,
                            5
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "input_1"
                    },
                    "name": "input_1",
                    "inbound_nodes": []
                },
                {
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    },
                    "name": "flatten",
                    "inbound_nodes": [
                        [
                            [
                                "input_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 16,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "dense",
                    "inbound_nodes": [
                        [
                            [
                                "flatten",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 16,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "dense_1",
                    "inbound_nodes": [
                        [
                            [
                                "dense",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_2",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 16,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "dense_2",
                    "inbound_nodes": [
                        [
                            [
                                "dense_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_3",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 16,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "dense_3",
                    "inbound_nodes": [
                        [
                            [
                                "dense_2",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_4",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 6,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "dense_4",
                    "inbound_nodes": [
                        [
                            [
                                "dense_3",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "input_1",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "dense_4",
                    0,
                    0
                ]
            ]
        }
    }
}